; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	spectrograph2 - mode
	thermograph4 - mode
	infrared5 - mode
	infrared3 - mode
	spectrograph0 - mode
	spectrograph1 - mode
	GroundStation0 - direction
	Star1 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star6 - direction
	Star7 - direction
	Star5 - direction
	Star8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 spectrograph1)
	(supports instrument0 spectrograph0)
	(supports instrument0 infrared5)
	(supports instrument0 thermograph4)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 Star5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
)
(:goal (and
	(have_image Star8 spectrograph1)
	(have_image Star8 spectrograph0)
	(have_image Phenomenon9 thermograph4)
	(have_image Phenomenon10 infrared3)
	(have_image Phenomenon10 spectrograph1)
	(have_image Planet11 spectrograph0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
2. (turn_to satellite0 phenomenon10 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon10)
   goals met: 0 of 6
3. (turn_to satellite0 star5 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star5)
   goals met: 0 of 6
4. (calibrate satellite0 instrument0 star5)
   added: (calibrated instrument0)
   goals met: 0 of 6
5. (turn_to satellite0 phenomenon10 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon10)
   goals met: 0 of 6
6. (take_image satellite0 phenomenon10 instrument0 infrared3)
   added: (have_image phenomenon10 infrared3)
   goals met: 1 of 6
7. (take_image satellite0 phenomenon10 instrument0 spectrograph1)
   added: (have_image phenomenon10 spectrograph1)
   goals met: 2 of 6
8. (turn_to satellite0 phenomenon9 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon9)
   goals met: 2 of 6
9. (take_image satellite0 phenomenon9 instrument0 thermograph4)
   added: (have_image phenomenon9 thermograph4)
   goals met: 3 of 6
10. (turn_to satellite0 planet11 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet11)
   goals met: 3 of 6
11. (take_image satellite0 planet11 instrument0 spectrograph0)
   added: (have_image planet11 spectrograph0)
   goals met: 4 of 6
12. (turn_to satellite0 star8 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star8)
   goals met: 4 of 6
13. (take_image satellite0 star8 instrument0 spectrograph0)
   added: (have_image star8 spectrograph0)
   goals met: 5 of 6
14. (take_image satellite0 star8 instrument0 spectrograph1)
   added: (have_image star8 spectrograph1)
   goals met: 6 of 6
